["Summary: Table discusses the effects of sudden braking and acceleration on fuel movement in the tank, impacting the timing of the low fuel warning lamp activation.", "Summary: Low fuel warning blinks for system defects; visit nearest TATA MOTORS Authorized Dealer/Service Center.", "Summary: Engine coolant temperature gauge function when ignition is \"ON\".", "Summary: Table describes temperature indicator ranges, with \"H\" indicating high and \"C\" indicating low. A RED progress bar signals overheating as the indicator nears \"H\".", "The table outlines actions and responses related to very high coolant temperature, including potential causes, recommended checks, and corrective measures.", "Summary: Engine coolant temperature warning: If the tell-tale light flashes and an audio warning sounds, stop the vehicle, turn off the engine, and let it cool. Contact a TATA MOTORS Authorized service center for assistance.", "Summary: The table highlights the risk of engine damage or fire due to overheating, indicated by a red progress bar showing high coolant temperature. Continuing to drive under these conditions can cause severe damage.", "Summary: Instructions for using the instrument cluster by pressing the button on the right-hand side of the steering wheel.", "Summary: IFE display issue with not showing the Fuel Economy of the last drive.", "Summary: Table details conditions under which a vehicle's display shows actual values, specifically when the vehicle is in motion.", "Summary: Display screen indication delay related to fuel consumption changes due to driving patterns.", "Summary: Table details how IFE (In-Flight Entertainment) varies based on different driving patterns.", "Summary: Table detailing engine power and torque values under specific driving conditions.", "Summary: AFE value estimates fuel economy, influenced by driving conditions, habits, and vehicle condition.", "The table provides data on average fuel economy, detailing vehicle types, fuel efficiency ratings, and comparisons across different years or regions.", "Summary: Instructions for operating the instrument cluster using the switch on the right-hand side of the steering wheel.", "Summary: The table details the reset behavior of trip metrics, indicating that trip time, average speed, and trip distance are reset to '0' when the trip meter is reset.", "Summary: The table outlines conditions for resetting and displaying vehicle metrics. Average Fuel Economy, Trip Time, and Average Speed reset to zero when the battery is removed and refitted. Average Fuel Economy shows as ‘—.—’ for the first 0.5 km of a trip, then updates after covering this distance.", "Summary: If the Average Fuel Economy shows as ‘—.—’ after 0.5 km, visit a TATA MOTORS Authorized Dealer/Service Center.", "Summary: Table shows approximate distance in kilometers a vehicle can travel with the current fuel level.", "The table provides information on how to reach the \"Distance to Empty\" feature in a vehicle's instrument cluster. It likely includes steps or menu options to access this feature, which estimates the remaining distance the vehicle can travel with the current fuel level.", "Summary: Features and controls located on the right-hand side of the steering wheel.", "Summary: Table on DTE (Distance to Empty) values, highlighting variability based on driving conditions, habits, and vehicle condition. Provides estimated available driving distance.", "Summary: Immediate fuel tank refill required if low fuel warning light is on, regardless of Distance to Empty (DTE) reading.", "Summary: Instrument cluster displays media, navigation, and FM information.", "Summary: Instructions for entering settings by pressing a specific button.", "Summary: Instructions for using the \"lect\" button within the settings screen.", "Summary: Instructions for changing options using the right-hand side button on the steering wheel.", "Summary: In the Settings menu, if no user input is detected for 10 seconds, the screen reverts to the previous display.", "Summary: Instructions for selecting illumination settings using the scroll and set button on the right-hand side of the steering wheel.", "Summary: Instructions for achieving 100% in five steps using the button on the right-hand side of the steering wheel.", "Summary: Table detailing steps to decrease illumination from 100%, including percentage reductions and corresponding actions or settings.", "Summary: Instructions for a 20% adjustment in five steps using the button on the right-hand side of the steering wheel.", "Summary: The table indicates that when the parking lamp is OFF, the option becomes greyed out and unselectable.", "Summary: Illuminated key ring glows when vehicle is unlocked to help locate ignition switch in the dark.", "Summary: Table of outside ambient temperature readings with ±1 °C accuracy.", "Summary: Temperature sensor location and factors affecting readings: front bumper placement, influenced by road heat reflection, engine heat, and traffic exhaust.", "The table describes the appearance of a \"snowflake\" symbol when the outside temperature drops below -1°C.", "Summary: Table of outside temperature readings, including date, time, location, and temperature values.", "Summary: Guidelines for accurate temperature readings in vehicles, requiring speeds above 30 km/h.", "Summary: Guidance for when OAT temperature display shows \"--\": take the car to a TATA authorized service center.", "Summary: Service reminder reset is enabled only when service is due or overdue.", "Summary: Instructions for resetting the service reminder symbol using up/down and set buttons.", "Summary: In the Settings menu, if no user input is detected for 10 seconds, the screen reverts to the previous display.", "Summary: Table outlines messages displayed on screen for three seconds based on priority, followed by warnings with minimized telltale symbols.", "Summary: The table lists various vehicle indicators, noting that not all may apply to every vehicle.", "Summary: Instrument Cluster needles and gauges perform a full sweep to maximum and return to zero when ignition is turned on, serving as a welcome strategy and self-check feature.", "Summary: Table detailing engine speed measured in revolutions per minute (RPM) using a tachometer.", "Summary: Avoid driving with high engine RPM to prevent engine damage and extend its lifespan.", "Summary: Fuel gauge operation when ignition switch is in \"ON\" position.", "Summary: Table indicating fuel tank levels, with \"F\" for full and \"E\" for empty.", "Summary: Low fuel warning light indicates the tank is nearly empty; refuel promptly.", "Summary: Low fuel warning blinks if system fault occurs; visit nearest TATA MOTORS Authorized Dealer/Service Center.", "Summary: Engine coolant temperature gauge function when ignition is \"ON\".", "Summary: Temperature indicator guidelines: Normal range between \"H\" and \"C\". Red bar signals overheating if near \"H\".", "Summary: High coolant temperature triggers a flashing tell-tale light and audible buzzer. Actions: Stop vehicle, turn off engine, allow cooling, and contact nearest TATA MOTORS service.", "The table lists authorized dealers and service centers for rectification services, including contact details and locations.", "Summary: Red progress bar indicates overheating from high coolant temperature, risking severe engine damage or fire if driving continues.", "Summary: Clock time feature available when ignition switch is ON.", "Summary: Table provides guidelines for using the IFE bar graph to improve fuel economy.", "Summary: IFE display issue with not showing the Fuel Economy of the last drive.", "Summary: Real-time fuel economy data when ignition is 'ON'.", "Summary: Table details conditions under which a vehicle's display shows actual values, specifically when the vehicle is in motion.", "Summary: Table discusses the delay in display indication due to changes in fuel consumption affected by driving patterns.", "Summary: The table details the reset behavior of trip time, average speed, and trip distance, which all reset to '0' when the trip meter is reset.", "Summary: The table outlines the display protocol for Average Fuel Economy in vehicles. Initially, for the first 0.5 km of a trip, the fuel economy is shown as ‘—.—’. After covering 0.5 km, the actual Average Fuel Economy is displayed.", "Summary: Guidance for TATA vehicle owners: If the average fuel economy shows as ‘—.—’ after covering 0.5 km, visit the nearest TATA MOTORS authorized service center.", "Summary: Table showing approximate travel distance in kilometers based on available fuel in the vehicle's tank.", "Summary: The table provides estimated Distance to Empty (DTE) values, highlighting variations based on driving conditions, habits, and vehicle condition.", "Summary: The DTE (Distance to Empty) figure updates when more than seven liters of fuel are added.", "Summary: Low fuel warning light indicates immediate refueling needed, regardless of Distance to Empty (DTE) display.", "Summary: Guidance for when \"DTE\" shows as \"—-\" on vehicle display, advising to visit a TATA MOTORS Authorized Dealer/Service Center.", "Summary: Table of outside ambient temperature readings with ±1 °C accuracy. Sensor located at vehicle's front bumper; readings may be influenced by road heat reflection, engine heat, and traffic exhaust.", "Summary: Instrument cluster and backlight brightness activate when parking lamp is turned on.", "Summary: Guidelines for changing clock and illumination settings in a vehicle, emphasizing safety by ensuring the vehicle is stationary.", "Summary: Table of screen messages with a four-second display time, organized by priority level.", "Summary: Table detailing gear numbers with corresponding up/down and auto/manual options.", "Summary: The table provides detailed information on battery charging, including charging methods, voltage levels, charging times, and efficiency rates. It may also cover battery types, safety precautions, and maintenance tips.", "Summary: Audio warning sounds if key is left in vehicle with ignition in 'OFF' position. Remove key to stop warning.", "Summary: Audio warning sounds nine times if the smart key is removed from a vehicle in ACC ON/IGN ON and the last door is closed.", "Summary: Table detailing the requirement for customers to bring the smart key inside the vehicle.", "Summary: Audio warning activates if park lamp is left ON; turn OFF park lamp to stop warning.", "Summary: Reminder to turn off park lamp to prevent vehicle battery drain.", "Summary: Park brake applied while driving triggers telltale light and continuous audio warning. Disengage park brake to stop warning.", "Summary: Engaging reverse gear triggers a buzzer sound alert.", "Summary: If the seatbelt is unfastened and the vehicle exceeds 15 km/h, a final audio warning activates for 90 seconds. During this time, the seat belt tell-tale light blinks.", "Summary: Front passenger seat belt reminder system: If unfastened and speed exceeds 15 km/h, audio warning activates for 90 seconds; seat belt tell-tale light status.", "Summary: Table detailing \"blicks\" occurrences when the audio alarm is active, including frequency, duration, and conditions.", "Summary: Instructions for fastening the seatbelt to disable the audio warning system.", "Summary: Vehicle lock attempt with open door triggers one flash and beep to indicate the door is open.", "Summary: Engine coolant temperature warning light and audio alert notify driver of high coolant temperature.", "Summary: Audio warning sounds every 120 seconds when vehicle speed exceeds 80 kmph.", "Summary: Continuous audio warning beeps activate when vehicle speed exceeds 120 km/h.", "The table details the changes and effects when a user switches the drive mode from \"city\" to other modes. It includes parameters such as fuel efficiency, engine performance, suspension adjustments, and steering sensitivity. Each mode transition is described with specific impacts on vehicle dynamics and user experience.", "Summary: Table details audio warning system for transitions between eco mode and city mode.", "Summary: Table details the feature that alerts drivers to rotate the steering wheel if the Electronic Steering Column Lock (ESCL) engages accidentally.", "Summary: Table outlines the alert system for water detection in fuel, indicating that a buzzer will sound as a warning.", "Summary: AMT system triggers a 3-second audio warning if a fault occurs.", "Summary: Instructions for moving a lever fully upward.", "Summary: Instructions for moving a lever fully downward.", "Summary: Table describes the automatic cancellation of a signal and lever reset after a turn is completed.", "Summary: Instructions for selecting the high beam function by moving the lever forward.", "Summary: Instructions for adjusting lever to normal position for low beam setting.", "Summary: Instructions for flashing high beam: Pull lever towards you from normal position; it returns to normal when released.", "Summary: Table detailing conditions or scenarios where all lamps are turned off.", "Summary: Instructions for turning on parking lamps by rotating the stalk.", "Summary: Instructions for activating the Low Beam function by rotating the stalk.", "Summary: Table details automatic headlight activation based on ambient light conditions.", "Summary: Table on driving conditions and safety measures when entering tunnels or during twilight.", "Summary: Information on Daytime Running Lamps (DRL) for vehicle visibility enhancement during daytime driving.", "Summary: Instructions for signaling a lane change: move the lever slightly up or down until the turn signal flashes six times automatically without latching.", "Summary: Inner rotary switch on right hand stalk for headlamp leveling. Adjusts headlamp focus in Low Beam and 'ON' position. Set correct position before starting trip when stationary. Adjust based on passengers and luggage by rotating to one of three levels.", "Summary: Table details the status of the wiper being switched 'OFF'.", "Summary: Instructions for operating intermittent wipe by pushing the stalk upwards.", "Summary: Inner rotary switch on left hand stalk controls intermittent front wiper delay with five settings. Push stalk to position (1) for single wipe.", "Summary: Instructions for continuous slow wipe by pushing the stalk towards position (2).", "Summary: Instructions for continuous fast wipe by pushing the stalk to position (3).", "Summary: Instructions for continuous windshield wiper operation: Pull stalk downwards for low-speed wiping; release to stop.", "Summary: Engine cranking temporarily cuts off power to the washer motor.", "Summary: Instructions for vehicles with rain and light sensors: Ensure the wiper stalk is set to \"Auto\" for automatic windscreen wiping when rain is detected.", "Summary: Engine cranking temporarily cuts off power to the washer motor.", "Summary: Instructions for operating rear windshield wash and wipe using a rotary knob. Turn clockwise and release to activate wipers for three cycles.", "Instructions for operating the rear windshield wiper: turn the rotary knob counterclockwise to align with the arrow mark for continuous operation.", "Summary: Rear wiper function disabled when tailgate is open.", "Summary: Instructions for operating rear windshield wash and wipe using a rotary knob. Turn counterclockwise to align with arrow, hold to activate wash and wipe, and release to return to rear wipe position.", "Summary: Rear wiper activates when reversing with front wipers 'ON'.", "Summary: The controller cuts off washer motor supply after 15 seconds of continuous wash and wipe operation to prevent overheating.", "Summary: Integrated rain and light sensor mounted on front windshield glass for detecting rain and light.", "Summary: Table detailing automatic operation of wipe and light functions based on sensor input.", "Summary: Fascia switches located on the driver side dashboard.", "Summary: Front fog lamps are on the front bumper, improving visibility in fog, snow, or rain. They activate when the fog lamp switch, ignition, and position/parking/head lamps are all 'ON'. An instrument cluster indicator shows when fog lights are active.", "The table details the dual functionality of front fog lamps, highlighting their role as cornering lights.", "Summary: Table details cornering lamps for vehicles, focusing on their function to enhance safety during night-time parking and turning by illuminating the side area.", "Summary: Instructions and guidelines for starting and driving a vehicle, including key steps, safety checks, and operational procedures.", "Summary: Instructions for enabling or disabling the ISS function using a push button located on the right side of the car's dashboard.", "Summary: Refer to the \"starting & driving\" section for detailed information on vehicle operation, including starting procedures and driving guidelines.", "Summary: Instructions for adjusting the volume of a music system or radio using a switch.", "Summary: Instructions for changing radio channels using a switch.", "Summary: Instructions for accepting an incoming call on a cell phone by pressing a switch.", "Summary: Table detailing Bluetooth connectivity features and specifications.", "Summary: Instructions for activating voice recognition via the steering wheel button. Audio mutes/pauses, a beep sounds, and the Voice Recognition screen appears on Infotainment."]