["The table provides details on the Driver Information System, covering the odometer, trip meter, clock, and service indicator. The odometer freezes at its maximum value, while the trip meter resets after 9999.9 km. The clock, adjustable via steering wheel switches or the infotainment system, requires resetting after battery reconnection. The service indicator shows days/kilometers until the next service, displaying \"0\" and a blinking spanner if overdue.", "Summary: The table provides information on driver alerts and indicators. It includes details on door ajar notifications, current gear position display, and gear recommendation system. Door alerts briefly pop up and then show a telltale. The current gear is shown on the display, with \"F\" indicating a system defect requiring service. For manual transmissions, the gear number appears when the clutch is released. Gear recommendations are shown with arrows for shifting up or down, with no arrow when the gear is optimal.", "Summary: The table lists alerts and corresponding messages for a vehicle's instrument cluster. Alerts include steering wheel rotation in ESCL jam, low key fob battery, smart key out of range, drive alert for breaks, steering failure warnings, clutch pedal press, and alignment of the steering wheel. Messages instruct actions like pressing the start button, replacing the battery, stopping the vehicle safely, contacting service, and aligning the steering wheel.", "The table provides alerts related to vehicle safety and operation: low fuel level, fasten seat belts for both driver and co-driver, and speed limit warnings for overspeeding.", "Summary: The table lists vehicle notifications and actions: Park Brake Engaged, Traction Control Off, Auto Headlamp Activated, Gear Change Needed for Cruise Speed, Cruise Override, and Auto Stop Start the Engine.", "Summary: The table lists various auto start and stop alerts and conditions, including low battery charge, low brake assist vacuum, high cabin temperature, low coolant temperature, and vehicle rolling. It also includes information on autonomous start enabled for low battery SOC, low brake vacuum, high cabin temperature, and low coolant temperature. Additionally, it mentions text alerts for auto start-stop enabled and disabled, and information messages on the instrument cluster.", "Summary: The table provides details on a Driver Information System, including the Odometer, Trip Meter A & B, Clock, Door Ajar warning, and Service Reminder. The Odometer tracks total distance without resetting, while the Trip Meter can be reset and tracks short distances. The Clock displays time in AM/PM and can be adjusted manually or via the infotainment system. The Door Ajar warning alerts when the driver or front passenger door is open. The Service Reminder indicates days/kilometers until the next service, displaying \"0\" if overdue, with a spanner symbol blinking at ignition.", "Summary: The table describes the Driver Information System's gear position indicator and gear recommendation features. It displays the current gear engaged, with \"F\" indicating a fault requiring immediate service. In manual transmission, the gear number shows even with a fully released clutch. Arrows indicate recommended gear changes, with no arrow when the gear matches vehicle dynamics.", "The table lists various vehicle alerts and notifications, including speed limit warnings, service reminders (by days and kilometers), low fuel and key fob battery alerts, smart key range issues, steering wheel rotation prompts, cruise control messages, autonomous start conditions, and a drive alert for a tea break. It also includes a special notification for the owner's birthday.", "Summary of Warning Lamps Table:\n\n- **Malfunction Indication Lamp (MIL):** Amber. Turns on with ignition, off after engine starts. Stays on for engine faults affecting emissions. Contact TATA MOTORS for service.\n- **Check Engine Lamp:** Amber. Turns on with ignition, off after engine starts. Stays on for Engine Management System faults. Contact TATA MOTORS for service.\n- **Immobilizer Lamp:** Red. Indicates engine start disabled if the wrong key is used. Blinks when immobilized, stays on for key/system issues. Off when authenticated. Contact TATA MOTORS for issues.\n- **Turn Signal Indicator:** Green. Blinks with turn signal operation and hazard switch. Accompanied by a tick-tock sound.", "The table describes warning lamp indicators for a vehicle, detailing their colors, functions, and actions required if issues arise. \n\n- **Blue Lamp**: Activates with high beam headlamps.\n- **Red Lamps**: \n  1. Indicates engine oil pressure; stays on if there's a fault in the electrical circuit/lubrication system.\n  2. Signals battery charging issues; requires charging at 3000 rpm for 15 minutes or contacting service if unresolved.\n  3. Blinking indicates a need for immediate service.\n  4. Relates to the parking brake; stays on if brake fluid is low or EBD malfunctions.\n\nFor persistent issues, contact a TATA MOTORS Authorized service center.", "Summary of Warning Lamps Table:\n\n- **Green Lamp**: Activates with ignition, turns off after engine starts.\n- **Red Lamp**: Indicates engine overheating; blinks with audio warning. Do not remove radiator cap when hot. Contact TATA MOTORS service immediately.\n- **Amber Lamp (Cruise Control)**: Indicates cruise control is active.\n- **Amber Lamp (ABS)**: Lights up with ignition, turns off if ABS is healthy. Stays on if ABS malfunctions; normal braking remains. Contact TATA MOTORS service.\n- **Amber Lamp (Sport Mode)**: Activates when SPORT mode is engaged for more torque.", "The table describes various warning lamps and their indicators for a vehicle. It includes:\n\n1. **Amber Lamp**: Activates when ignition is on and turns off after engine start. Stays on if fuel is low; flashes for fuel system faults. Contact TATA MOTORS if flashing.\n   \n2. **Red Lamp**: Indicates driver seatbelt is unfastened. Stays on with ignition and sounds an audio warning if speed exceeds 15 km/h. Turns off when seatbelt is fastened or reverse gear is engaged.\n\n3. **Amber Lamp**: Lights up if the smart key is not detected inside the vehicle.\n\n4. **Amber Lamp**: Activates with ignition until the clutch pedal is pressed to start the engine.\n\n5. **Amber Lamp**: Indicates excess water in the fuel filter. Blinks with a chime; contact TATA MOTORS to drain water immediately.", "The table summarizes vehicle warning lamps and their functions:\n\n1. **Daytime Running Lamps (DRL):** Green indicator; activates when DRL is on. Requires parking lamp to start.\n\n2. **Door Ajar Lamp:** White/Red indicator; signals when any door or tailgate is open.\n\n3. **Front Passenger Seat Belt Indicator:** Red indicator; activates when ignition is on and seatbelt is unfastened. Includes audio warning if speed exceeds 15 km/h. Deactivates when seatbelt is fastened or reverse gear is engaged.\n\n4. **Speed Limit Warning Indicator:** Amber indicator; activates with an audio chime when speed exceeds 80 km/h, repeating every two minutes.", "Summary of Warning Lamps Table:\n\n- **Green Lamp**: Indicates 'Economy' drive mode for better fuel economy.\n- **White/Blue Lamp**: Indicates 'City' drive mode for optimal torque and fuel economy.\n- **Amber Lamp**: \n  - Speed limit warning: Flashes and gives audio warning above 120 kmph; less frequent audio between 80-120 kmph; turns off below 80 kmph.\n  - DPF warning: Indicates need for regeneration to eliminate pollutants; not a malfunction. Requires driving at 50-80 kmph, 3rd gear, engine speed over 2000 rpm for about 20 minutes to turn off.", "Summary: The table outlines warning lamp indicators and their meanings. Amber lights indicate issues with DPF regeneration, EPAS faults, and Automatic Manual Transmission faults. If the DPF procedure is not followed, the MIL lamp will activate. For any faults, contact a TATA authorized service center. Amber lights also illuminate momentarily when the ignition is switched on."]